<a href="https://colab.research.google.com/github/xLustosa/Notebooks/blob/main/Demographic_Data_Analyzer.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Dataset Source**
Dua, D. and Graff, C. (2019). UCI Machine Learning Repository [http://archive.ics.uci.edu/ml]. Irvine, CA: University of California, School of Information and Computer Science.

In [1]:
import pandas as pd
url = 'https://raw.githubusercontent.com/xLustosa/Notebooks/main/adult.data.csv'
df = pd.read_csv(url)

In [2]:
df.head()

   age         workclass  fnlwgt  ... hours-per-week  native-country salary
0   39         State-gov   77516  ...             40   United-States  <=50K
1   50  Self-emp-not-inc   83311  ...             13   United-States  <=50K
2   38           Private  215646  ...             40   United-States  <=50K
3   53           Private  234721  ...             40   United-States  <=50K
4   28           Private  338409  ...             40            Cuba  <=50K

[5 rows x 15 columns]

# 1. How many people of each race are represented in this dataset? This should be a Pandas series with race names as the index labels. (race column)

In [3]:
df_race = pd.DataFrame({'Total':df.race.value_counts()})
df_race

                    Total
White               27816
Black                3124
Asian-Pac-Islander   1039
Amer-Indian-Eskimo    311
Other                 271

# 2. What is the average age of men?

In [4]:
filter = df['sex'] == "Male"
df[filter].age.mean()

39.43354749885268

# 3. What is the percentage of people who have a Bachelor's degree?

In [5]:
df_edu = pd.DataFrame({'Total':df.education.value_counts()})
percent = (df_edu.Total['Bachelors']/df_edu.sum())*100
print(percent.Total,'%')

16.44605509658794 %

# 4. What percentage of people with advanced education (Bachelors, Masters, or Doctorate) make more than 50K?

In [6]:
df_sal = pd.DataFrame({'Total':df.groupby('salary').education.value_counts()})
x_more = df_sal.Total.loc[(">50K", "Bachelors")] + df_sal.Total.loc[(">50K", "Masters")] + df_sal.Total.loc[(">50K", "Doctorate")]
x_less = df_sal.Total.loc[("<=50K", "Bachelors")] + df_sal.Total.loc[("<=50K", "Masters")] + df_sal.Total.loc[("<=50K", "Doctorate")]
percent_sal = (x_more/(x_more + x_less))*100
percent_sal
print(percent_sal,'%')

46.535843011613935 %

# 5. What percentage of people without advanced education make more than 50K?

In [7]:
df_w = pd.DataFrame({'Total':df.groupby('salary').education.value_counts()})
total_more = (df_w.Total.loc[(">50K")].sum()) - x_more
total_less = (df_w.Total.loc[("<=50K")].sum()) - x_less
percent_w = (total_more/(total_more + total_less))*100
print(percent_w,'%')

17.3713601914639 %

# 6. What is the minimum number of hours a person works per week?

In [8]:
df['hours-per-week'].min()

1

# 7. What percentage of the people who work the minimum number of hours per week have a salary of more than 50K?

In [9]:
filter2 = df['hours-per-week'] == 1
df_hour = df[filter2]
x = len(df_hour[(df_hour.salary == '>50K')])
y = len(df_hour)
percent_min = (x/y)*100
print(percent_min,'%')

10.0 %

# 8. What country has the highest percentage of people that earn >50K and what is that percentage?

In [10]:
df_country = pd.DataFrame({'Total':df.groupby('native-country').salary.value_counts()})
#pd.set_option('display.max_rows', None)
print(df_country)

                       Total
native-country salary
?              <=50K     437
               >50K      146
Cambodia       <=50K      12
               >50K        7
Canada         <=50K      82
...                      ...
United-States  >50K     7171
Vietnam        <=50K      62
               >50K        5
Yugoslavia     <=50K      10
               >50K        6

[82 rows x 1 columns]

In [21]:
df_percent = pd.DataFrame()
for i in range(len(df_country)):
    if (i%2==0) or (i==0):
      t = df_country.iloc[i] + df_country.iloc[i+1]
      x = (df_country.iloc[i+1]/t)*100
      country = df_country.index[i]
      select = country[0]
      new_row =  {'Country': select, 'Total': x.Total}
      df_percent = df_percent.append(new_row, ignore_index=True)
    else:
      continue  
    
filter4 = df_percent['Total'] == df_percent.Total.max()
df_percent[filter4]

   Country      Total
25    Laos  99.673203

# 9. Identify the most popular occupation for those who earn >50K in India.

In [22]:
filter5 = df['native-country'] == 'India' 
df_india = df[filter5]
filter6 = df_india['salary'] == '>50K'
df_india = df_india[filter6]

In [23]:

df_occupation = pd.DataFrame({'Total':df_india.occupation.value_counts()})
##pd.set_option('display.max_rows', None)
print(df_occupation)

                  Total
Prof-specialty       25
Exec-managerial       8
Other-service         2
Tech-support          2
Sales                 1
Transport-moving      1
Adm-clerical          1

In [15]:
filter7 = df_occupation['Total'] == df_occupation.Total.max()
df_occupation[filter7]

                Total
Prof-specialty     25